# PrintSetup Properties

---
The PrintSetup type exposes the following members.
| Name| Description
---|---|---
| CurrentPrintSetting| The current Print Setting of Print Setup.
| InSession| The in-session Print Setting of Print Setup.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
Top
#### Reference
PrintSetup Class
Autodesk.Revit.DB Namespace